Revit 2026 API

# RebarFreeFormAccessorGetServerGUID Method

---

Returns the GUID of the API server.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Guid GetServerGUID()
```
```vb
Public Function GetServerGUID As Guid
```
```cpp
public:
Guid GetServerGUID()
```
```fsharp
member GetServerGUID : unit -> Guid
```

#### Return Value

Guid The GUID of the API server

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. |

#### Reference

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace